{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"tokens:0": {"name": "tokens:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4250"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "9"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "tokens", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "tokens", "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup", "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims_1", "unknown_1"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["-3"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d/Relu", "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims_1", "unknown_3"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/conv_spacer1/conv1d_1/BiasAdd", "StatefulPartitionedCall/conv_spacer1/strided_slice/stack", "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_1", "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "4"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "3"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/conv_spacer1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/conv_spacer1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/conv_spacer1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [4250, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer1/embedding/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d/conv1d/ExpandDims_1", "shape": [1, 9, 64, 128], "dtype": "float32"}, {"name": "unknown_1", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/conv1d_1/conv1d/ExpandDims_1", "shape": [1, 3, 128, 1], "dtype": "float32"}, {"name": "unknown_3", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/conv_spacer1/strided_slice/stack_2", "shape": [3], "dtype": "int32"}]}]}