<PAD>
<UNK>
 
ㅋ
이
아
어
고
가
그
다
지
나
는
하
?
도
서
.
요
기
야
해
자
에
니
데
게
안
거
오
면
리
은
내
라
있
사
시
래
보
일
만
까
네
한
으
구
로
을
좋
너
먹
제
마
랑
겠
들
무
여
말
응
진
었
주
했
우
ㅎ
러
!
려
수
뭐
잘
대
인
금
정
같
ㅠ
부
없
음
왜
더
알
저
생
근
난
짜
할
미
워
늘
전
히
모
바
럼
것
스
많
간
건
애
상
싶
웅
와
렇
빠
좀
귀
되
예
집
심
냥
냐
못
~
때
았
화
치
를
쪽
,
런
장
르
중
연
비
의
봐
맞
각
신
돼
당
조
소
분
원
ㅜ
찮
디
공
람
피
잖
두
괜
언
날
실
테
뽀
세
배
동
직
않
걸
1
친
운
누
방
왔
갈
얼
번
남
엄
님
줄
단
학
잠
드
밥
행
물
형
끝
든
울
른
터
속
재
머
용
입
줘
헤
문
트
약
영
져
청
발
교
버
살
개
경
힘
올
민
계
노
싫
쁘
또
몰
따
맛
긴
적
차
유
파
군
졸
감
엉
프
선
불
놀
찍
2
준
빨
타
혼
던
호
받
성
0
났
ㅇ
과
달
착
허
후
임
열
늦
겨
국
느
반
막
점
처
볼
카
곤
씻
락
죠
매
랬
쓰
식
강
얘
갔
토
쉬
뻐
써
침
새
크
눈
레
뭔
키
끼
위
질
회
길
슨
글
떻
엽
목
앙
통
천
추
함
봤
편
출
3
죽
현
역
헐
별
닌
씨
관
업
양
루
명
망
꾸
태
름
손
복
답
박
잉
웃
작
녁
넘
잤
렸
습
ㄱ
깐
린
담
졌
ㅡ
옹
술
휴
완
쁜
참
톡
산
넹
본
ㄴ
갑
럴
설
잡
됐
코
5
림
녀
포
김
슬
셔
결
먼
넌
걱
앞
싸
뭘
였
께
온
케
존
티
커
돈
체
럽
초
^
엔
듯
징
병
벌
찾
능
증
맨
앗
억
릴
된
절
돌
년
쳐
밌
듣
깨
외
잇
력
궁
떡
슈
굴
몸
튼
♡
꼭
딱
충
웠
밖
메
꿈
퇴
4
항
평
색
백
셨
순
취
꺼
챙
험
찌
ㅅ
폰
옷
끄
며
표
낼
멋
잔
짱
최
흠
필
확
겟
될
텐
월
밤
변
둘
란
놓
꼬
즘
혜
흐
몇
합
종
똑
옆
플
엇
등
움
채
책
욕
뎅
풀
줬
페
겼
투
곧
6
랐
격
쳤
얌
멀
혀
닝
윤
뒤
론
족
떤
급
솔
흥
쟈
삼
뜻
낌
승
맘
섭
암
7
넣
빼
9
걔
8
쩌
팅
밀
쯤
ㄷ
푹
떨
팔
떠
석
희
믿
철
숙
규
퍼
왕
빈
킨
쿠
멍
햇
붙
곳
읽
걍
켜
창
찬
쪼
악
딩
욤
빵
틀
픈
헉
큰
송
향
앉
짓
즈
닥
료
황
록
흑
힝
섹
효
벽
십
법
혹
택
옴
끊
끔
판
뿌
춥
쓸
ㅌ
접
환
냈
겁
낭
큼
짝
녕
패
뜨
랜
짐
삐
독
홍
슴
축
둥
북
탈
육
브
널
;
째
빡
샤
왓
칠
쉽
덩
쩔
엥
쟁
검
ㅏ
덕
뇨
탔
낮
랭
깔
-
껴
젠
광
햄
벗
베
골
땐
숨
닮
쪄
낫
굿
핑
롱
훈
씩
품
특
탕
욜
낸
권
랄
덥
봉
옥
즐
ㅈ
컴
션
샀
염
맥
롭
꿔
♥
꿀
냄
핸
맙
칭
쎄
컨
익
:
곰
ㅂ
농
겡
덜
썼
잼
극
닐
냠
껄
땡
됨
콜
봄
척
놈
렵
블
갖
뻔
헿
탁
립
푸
'
웡
깼
죄
댕
젤
앜
뿐
딘
윈
몽
링
범
짧
롬
쌍
류
깜
ㅓ
벅
괴
견
놔
콩
활
첫
냉
줌
렁
득
팀
ㄹ
똥
슷
논
딸
ㅁ
춰
쭈
렀
량
엌
쟤
련
굳
헷
볶
빌
풍
_
층
잊
닭
뛰
캐
클
섯
뽑
꿨
령
꽃
쓴
몬
탄
쥬
쌤
랴
센
딴
촌
긍
놨
꺄
깅
)
깝
폭
쌀
씀
쿤
쫌
렌
뉴
홀
높
밍
퓨
콘
켰
댜
덮
혁
쇼
텔
녹
칼
뇽
빤
균
씹
밑
랫
젖
릿
❤
좆
ㅣ
끌
왠
졍
묻
쪙
곡
꽤
빙
넷
빴
획
춘
띠
팬
쿄
쏘
윽
믄
쑤
딜
흔
멘
털
묵
총
씬
곱
겸
찰
뿅
융
탐
훨
턴
댓
찡
첨
룸
쿨
팠
옛
옮
큐
킹
엑
짠
념
릉
끈
걷
둬
쨌
넵
륵
잃
뒷
욱
킬
쭉
쁠
싱
댔
액
눌
찜
맡
겹
삭
쩡
벼
쩐
떼
팩
압
샘
팡
힌
탱
뀌
켓
깡
욥
렴
쉴
혔
핫
쨔
얔
흘
캬
갓
닦
렷
럭
뚝
츠
낙
ㅗ
️
💕
뚱
탓
힐
캡
츄
빛
헛
닫
왱
웬
혯
뻥
뷰
꾼
쿵
꼈
롤
ㅐ
옵
튀
뀨
숭
썽
묶
춤
짤
밝
갸
딨
쁨
찐
므
쫄
듬
멈
잌
깊
갠
ㄲ
겅
얻
찔
셈
읍
릭
릎
례
끗
납
붕
맹
쥐
얍
칫
깍
ㅔ
앵
늙
틈
헬
혐
핳
엘
싼
넓
촉
s
뚜
컵
셀
녔
닠
땠
뜯
폐
땅
밋
땀
햐
좌
협
굉
끓
튜
뜩
넴
툰
삶
뮤
힣
셋
잣
흡
녜
왤
꼼
봣
쌓
>
헝
율
뺏
룩
엎
겜
낳
닼
꼴
칙
뻤
릇
껏
뒀
벨
훗
쩍
굶
낄
쾌
휘
랍
헹
닙
뎈
뜬
룰
슝
웹
혈
넼
픔
쌈
쳇
탑
흰
뒈
홈
됬
긁
쵸
앤
훔
묘
셧
뽕
짘
뇌
<
둔
객
췄
컸
ㅊ
컷
땜
끙
듀
ㅆ
긔
샐
눕
뱃
엠
죵
톱
꽉
놉
겐
홉
왼
얀
썩
쌩
먄
찝
콤
긋
틴
졋
헌
줭
률
곸
힛
좁
넝
뎌
뭉
낀
샵
랰
훌
썸
싹
펴
멜
@
ㅃ
꽂
짬
찢
껭
꽁
뿡
벤
윗
봅
킁
닿
얄
(
뷔
웟
닷
컬
밴
#
굼
떴
눠
촬
얇
귄
닉
핵
웨
셩
껐
ㅛ
됩
썹
겄
쮸
ㅍ
봥
펜
펑
덤
ㅑ
렛
틱
뚫
픽
😘
냅
팝
뺨
퀴
값
쟝
😍
턱
겉
띵
c
즁
밉
젊
퉁
셉
m
섬
쫓
쩜
눙
숫
뱅
랏
숑
깻
샷
/
델
%
콧
햌
*
깎
a
뼈
뻗
팍
쬬
쉿
램
됏
=
덟
😉
샌
싯
겻
빗
꿍
핥
텨
댄
쏟
빔
갱
캠
뜸
볍
템
텀
뤄
랙
"
홧
엿
돋
킴
낯
략
핀
렉
깬
괘
떵
맑
껀
💗
꾹
뱉
옳
컹
ㄸ
붓
읭
맴
낑
갤
섞
삿
쪘
뒹
캔
묜
껍
랩
+
깃
굽
밟
쬭
욬
렬
띄
튕
컥
룽
ㅉ
p
낰
둑
앨
귤
넉
욘
o
t
칸
팟
엣
웤
씌
쫍
빅
낚
맵
뇸
틸
줍
랗
넨
븐
욧
팸
흉
쇠
A
즉
릅
럿
v
텍
뢰
곁
T
쉰
측
돔
썰
뜽
룡
쩝
랔
띨
씽
꺅
뺐
i
멸
댐
됫
륭
핰
쳣
섴
퉤
긱
왴
냨
똘
뿔
줫
뭇
꼽
훅
밧
퍽
d
헣
b
잎
e
댱
뉘
됑
😊
꽈
콕
ㅕ
룬
벙
뺄
뜰
짖
쀼
됴
댈
숩
갘
멤
겪
옼
걘
B
곀
궈
푼
S
쏙
쌌
벚
늑
핏
즌
갚
냇
롯
g
딧
펐
쑥
삽
얏
팜
귈
깰
뿜
슉
칩
펀
늠
셤
뱌
찼
윙
쨩
k
쫑
찹
뾰
땨
겤
😌
껌
갰
닳
폴
…
쇄
몫
앓
쨋
쨍
썬
놋
씁
늬
x
흫
뀐
댁
듦
z
깥
옙
💞
뵈
샴
펭
쉐
빳
깽
훙
돠
꼰
뻘
툴
렐
톤
쥴
💓
첩
뻑
캄
쯔
껑
썅
뵙
킄
듕
숲
뎃
쿼
먀
솜
딪
뭣
큭
C
슥
풉
쭝
섰
봇
깤
쬐
폈
툭
꿇
몹
돕
팽
풋
엮
넥
빚
뎁
쿡
썻
쎠
M
팥
쎈
왈
D
ㆍ
n
젛
떄
쏭
룹
읏
읎
둡
샹
쏠
덧
둠
엊
댘
엨
냔
콱
닛
렙
갯
쐬
츤
홓
얹
숴
😙
롸
옄
뀜
걀
짴
햤
렜
떳
굵
엏
퐁
췌
뗘
뺀
솥
셜
쉅
젝
퍄
횟
쌔
헴
💋
맣
돗
흙
핡
팁
쭤
😁
깄
숍
얜
뀔
짭
G
믹
뭥
놧
☆
앟
횡
l
츈
😗
텼
갇
꺾
읔
젓
뎀
젼
됭
퀘
헙
웩
f
P
홋
떽
챱
r
렘
옶
잨
챠
쟨
X
밭
O
슐
앖
💜
뱀
삘
탠
얗
🏻
짚
왛
폼
힉
몀
펌
숏
킼
떰
딥
깠
펙
뽁
왁
켯
ㄳ
괄
뵤
쭁
훠
텝
귓
킵
맠
]
눼
😭
텅
눅
맺
펄
멎
u
햏
깈
왘
갛
쓱
☺
솟
혓
칵
빕
슙
h
샥
헥
w
쒸
뚠
쨘
녱
깁
츕
젯
듭
뤘
싳
[
훼
뻣
훟
짰
갬
씸
앱
븅
ᆞ
퀄
웰
칰
먕
셍
😚
맏
넛
꾜
쫙
L
K
쏴
힙
꿧
킥
뀽
V
늉
햅
흣
캣
쥰
앰
촤
웁
잏
뮬
넫
괌
귱
❣
쫀
궄
덴
뎡
꺌
쾅
뫄
꼇
쟀
탭
︎
ᆢ
샜
딕
돜
싈
\
땄
벳
😆
럈
쉼
멱
멧
밸
뽐
꽝
멕
😝
챡
헠
😂
랠
즙
펼
겔
빽
얽
펠
숟
뤼
뺑
톨
잭
갗
뿍
뉸
꽥
쯧
볕
빰
y
삥
륙
쏜
꾀
뜌
짢
👍
R
밬
😋
뢔
띡
겈
쿰
뺘
붉
땃
봨
얕
둣
낟
큥
꿉
뚤
뎨
튭
렼
딤
졐
슘
퉷
륨
끽
잦
쟌
퐈
젱
윌
쇽
벡
및
쫘
맄
밈
뤠
챗
읶
윰
휠
륜
듈
핼
췟
짆
뭡
Z
읊
쭘
펫
얶
눴
겝
켁
렄
힠
I
캉
쟐
묭
꼐
핮
쩨
뛴
첸
•
쌰
😄
팰
🙈
겧
쥼
😢
😅
쭐
★
챔
뛸
멩
퀸
캭
쓔
핟
롴
깸
셰
얒
뷴
😳
쯰
겆
룜
놬
쌉
춍
슌
헨
꿰
끠
H
웈
맷
쟉
춝
쨜
톰
잰
넬
엡
킷
앀
퀵
😏
꿋
댑
큣
똔
됌
큔
💛
씼
🙏
샛
겎
햣
땟
픕
넜
뭄
ㅝ
💙
찻
켬
앍
젭
춉
즛
틋
F
앎
쥥
랖
붐
얐
씐
j
U
탆
켈
촵
큽
Q
촛
냌
땽
짇
밨
앴
궜
궂
싴
뎄
’
뭨
껨
읕
읺
빱
쬽
뮹
훑
줏
뗄
ㅢ
욌
E
깟
옇
믕
앆
쁑
꿑
끅
튈
쵝
옸
젬
짙
굔
틍
땋
쭙
듸
휙
J
뽜
왬
횽
읗
늪
웜
N
옿
냘
룻
뮨
밎
곘
튄
퇵
곽
릐
맬
쎙
랃
Y
낱
탸
씅
싣
끜
렝
챘
맟
켔
훤
켄
뉭
흨
덯
켤
뷸
쉘
녘
핌
숯
😣
👏
즤
쳥
츙
핬
킈
벘
쎵
싷
롷
숱
😐
넋
맸
죤
텄
됔
씰
띰
ㅖ
퍙
냬
😬
💖
쫒
뺴
궤
켘
툽
뵐
탬
봌
쯉
잴
쑈
뭬
캌
슼
믈
둉
컄
쑝
냑
쿱
뵹
겋
띤
흩
뉑
됀
😯
휩
꺽
맀
샸
쪗
👀
쉑
쌋
죻
눔
칞
팤
렠
붸
뷥
셌
짹
샄
놰
🐕
☞
☜
섣
&
쨀
윳
돟
😀
몈
줰
굠
켠
늗
첵
😥
뮈
똬
쪈
촥
걌
앚
쎅
펩
뗭
쌕
뱔
혬
촙
쥔
툼
뵨
앳
볐
먿
먾
뚬
셥
봬
싀
켕
쉣
컁
짛
낵
닜
삑
뗐
봊
잫
뚀
🤔
곺
챌
뺌
쟜
믐
쥭
싰
꺙
닪
뽄
😞
꿩
왐
큘
갹
펏
쨰
뼛
잽
휑
욀
쒀
걐
😛
갼
챕
솨
댠
덱
핍
뉨
뀰
ㅘ
읅
럄
삔
쎀
캇
둿
펨
퐝
닊
쿜
뉵
뭠
읻
🙆
왭
윅
꼿
ㅙ
멓
🐶
졈
쟛
탤
톧
옜
믾
휭
갴
쬠
싄
갭
뾱
옝
쟘
춌
떫
앝
쁩
찯
찧
옘
맢
쥽
휜
컾
퓌
헵
긑
챈
냣
왑
섀
폿
콸
귐
릏
푠
끛
‍
놩
쿸
쿙
믓
귯
빸
쟙
횬
춧
잒
힁
삣
뷱
렣
닏
짯
츰
깉
끵
좊
빻
좃
녓
쐈
햬
젆
귿
캎
😔
캥
똫
텁
칮
퍈
먁
👋
캘
W
랳
뺙
젔
냡
뭍
븜
뵌
쏼
뽝
컼
껰
`
ㅒ
둨
쉈
🤗
콰
쨕
젴
먐
읒
긌
얖
쎔
헸
퐉
죰
굥
곶
듷
텟
쳨
땍
셬
💟
햨
늕
햊
🙌
앸
뜀
낍
촐
뱡
챴
빋
껜
잗
😻
😒
😑
뵜
낞
뫃
¡
큨
눚
쐐
쯀
졓
듄
쑴
샾
죙
곗
뒁
핱
뒙
밯
띁
츼
q
캴
뽈
봑
웋
몃
|
핶
칡
츨
폄
밪
럐
👶
🌙
쥑
껒
죳
짲
쪜
뉍
쮹
줒
듐
쳉
넿
퉈
졀
럌
쓩
얃
궨
뎠
횐
낡
츅
탇
괭
ㅟ
숖
짼
듁
🎶
랒
샆
죸
밐
녠
꿱
쮜
쿗
늫
볻
뱍
웍
햘
줴
몄
툐
“
”
옾
캅
탯
슛
헑
첼
‘
쯍
묽
뙇
싐
엳
헀
늄
좨
😠
뮴
럇
뇬
섷
땈
뤈
췃
꽇
흌
🌸
좡
🔥
}
쉭
😡
줅
춪
먗
닁
뉜
😪
🐥
🙄
랸
슺
샨
×
왂
햿
샅
곻
퓽
햠
쒯
녬
텡
웂
떢
숰
뷁
렂
쎼
뺭
뚕
댬
짔
챵
끕
꽌
괵
귕
푱
껠
졷
폇
굡
팼
딛
늨
딬
얺
찟
👉
👈
⭐
갉
쎘
몯
곯
읐
퇘
팻
붘
뎊
💘
ㅄ
놑
좔
👄
💩
랊
뜍
¿
쏨
샇
덬
옂
앛
왯
·
휸
쑨
햔
뱐
럾
묯
윷
궐
💝
깇
띾
춋
첮
췻
귝
꺠
돤
썪
쯜
넒
똭
녑
챃
깦
쳔
굑
왝
😤
흗
뇹
뛔
쨥
쵹
훕
뤃
퉜
챀
눤
죡
샬
잍
벵
ㄻ
흿
묠
싁
챳
릌
뢩
콥
봔
촘
텻
젹
놯
캤
퀭
죗
쯩
즇
둏
뻡
똨
텃
닽
멐
퀏
귾
놐
꽹
튬
´
닞
깋
픙
솓
섁
걜
맂
눀
쨤
쁍
렿
톼
렺
쁭
쟠
뚁
짞
곈
😵
껬
봈
쨈
뤙
젇
쯘
욯
뀸
멬
잿
웽
툉
삵
뤵
튠
홯
홬
븟
첞
쒜
뫙
꽐
욍
♀
팈
욋
윾
햍
깆
췬
쁌
냪
닺
틔
줔
짊
긩
옺
퐄
좝
딍
휫
륽
싲
칀
읜
붑
맼
껫
슁
땔
됰
훜
🥰
셒
☝
돵
밓
닸
엍
덫
퓰
댴
숔
랚
챤
믱
쟣
됸
괸
탘
옌
쀍
뎋
앋
텤
귘
넽
흄
퀼
튱
뼘
댸
👊
콬
럅
엤
뢌
뢈
뿝
긘
뙈
奶
쑹
줠
엫
：
롣
뵬
뱄
쿕
뢍
땤
쫗
끋
눵
굤
‥
롄
돴
쳌
렦
컀
붜
뭦
븨
윸
뼝
릊
꺆
툇
넚
놘
돛
✨
몆
♤
뒝
뀬
겍
줕
땸
찎
욮
푀
욷
븡
쟎
뗀
🌹
줸
핧
풓
웝
🎧
홑
숀
볏
룝
졔
퍗
몉
빝
ㅞ
궃
퍕
쯈
뱝
읹
쁴
뫼
핤
뤸
뭌
횹
퐘
읆
풰
똣
깪
썜
퍅
곪
긇
낔
넙
탹
붇
헗
죔
괫
긷
샊
씯
맍
😫
샠
녈
읃
옐
쉥
빜
죨
🐟
넄
낢
닢
휵
읾
짅
봫
픵
쪔
빧
앻
덷
팄
켐
뻬
퀀
헼
뫠
뭏
쫏
곹
졎
쐴
샙
꼉
륀
숳
첬
🐰
돚
괙
쥘
캨
춚
💚
뻨
띈
믺
햑
뱓
뺩
륩
｀
팃
팓
툑
헳
☹
😴
🙀
❌
✊
웆
삳
맗
좠
륻
슄
댯
긤
✌
옠
÷
옻
쉨
뎔
뱁
흴
꿯
쇤
🌟
돨
랂
됼
봏
햡
몊
잙
쐇
💏
🐷
🙋
🐱
🙊
💪
😃
$
돾
👨
욭
끀
퓻
죱
엪
싵
켴
톹
캿
쿔
뗴
꺘
잚
샂
깹
닯
챦
햝
뭊
짗
앐
💦
갂
큳
쎱
줜
풐
놕
엾
탖
휼
읰
췽
푿
닡
쟄
긓
졉
턷
뮐
°
뮥
긂
궹
잀
땁
찃
낲
챨
줃
읨
픠
춬
믜
씾
댝
줙
굨
쌐
핢
숐
끰
킠
쁀
롼
싑
밷
쩻
픂
뇻
쨬
긎
넸
됄
욿
😎
😮
븝
깩
펔
헕
룟
겥
뿨
닣
윱
읋
띌
텈
쫭
녭
겯
떙
륏
쑵
쥡
뚯
춛
횻
숸
뗏
냏
펍
뎆
궝
괨
괬
돱
🎀
닻
뺍
븍
먜
똠
퇸
쪅
좇
닰
뎍
뵀
잟
？
븬
픅
왚
뺜
윀
긐
궛
됒
톢
꼌
븉
뤱
뇰
댤
랟
핔
껔
먆
멏
붂
솊
🎉
쫃
😜
👅
칬
😶
욪
츊
캈
즠
뤀
퉄
맜
뽘
▽
붗
랮
옦
뭫
줗
옅
묹
뉼
윔
솤
탣
볌
씷
엯
걋
쫩
맪
늤
깒
θ
ノ
젺
잲
넞
낶
볾
🙇
뢉
옭
붱
렗
😿
긏
잆
쨐
뢸
퓸
흼
읁
쪌
쭞
먈
故
똒
쭸
잋
퇄
人
썌
싢
🙃
앏
뫁
얠
걻
꿎
뛀
놂
웕
욺
눟
팖
쩩
갷
갋
튁
몼
돡
뤌
콪
❄
😸
늣
떈
풒
듳
츱
낏
좐
꾱
뮌
大
췍
뎟
쨉
혿
❗
셮
쎜
엦
눗
쭇
큠
켱
껩
떱
귬
샏
ㅀ
녇
홒
✋
힗
짏
삻
🔫
횤
붖
줨
렾
뇠
섕
ㅚ
펖
륄
뤨
씡
셕
뜹
팧
쩬
ʘ
🍒
붛
륑
싿
랼
쎌
쌘
릑
꼥
킛
돞
칏
쪠
웢
낻
뤡
왖
롹
넢
쉔
슆
쪕
췤
꼳
풱
쀄
꺗
뷜
촠
핻
꺴
췅
푭
걁
껆
뚞
튓
렫
뽓
쳡
얭
둌
퉥
늒
룍
쵀
딋
끾
낅
뜁
쨨
쀠
츀
혖
떸
헫
핃
쇈
삉
뀻
룐
🖤
💃
첟
틷
큩
😇
ᕙ
ᕗ
믽
뽚
짦
띱
켑
쓋
픜
혘
헞
럏
띔
윺
렍
🤬
꺍
녴
칳
큅
꿘
껅
봡
🤍
폔
뜜
쭌
싮
빢
얾
삲
톈
찿
옒
셯
즨
횸
랱
떺
퓬
멨
퐛
싪
섲
옃
죾
붌
뀩
왷
퀠
젘
솝
얙
쬰
땬
괟
볓
괮
컫
듶
쀡
🔋
넠
옫
욨
뮦
땩
춴
옽
츷
춫
솧
♪
휍
뽷
뢀
쭵
뉌
뙹
됮
💐
듴
🌀
챜
턔
￦
🐳
멉
🤝
맩
🍦
섻
🤩
캑
쟂
듲
✈
헢
뫀
줩
뀡
걈
풔
뀠
궇
튿
🤣
늡
◇
뾴
엋
❁
맻
뵛
눨
🤜
싓
뻠
릔
뮷
믇
딲
쪾
봠
홐
콯
냩
쎸
뎽
늼
삯
뾸
❕
잧
둗
탰
셎
엶
😲
뤤
붋
🤓
떧
긿
쏬
뭅
😟
팉
캽
왇
혰
둫
톸
뽤
뭴
챂
겾
쬣
웱
뽱
솸
뙁
넺
췸
꺜
똰
큿
댗
꾾
젣
녿
벆
뎐
꽅
솩
탉
롮
녚
팆
덪
싞
벋
댰
켞
봒
섢
쉇
🍓
뜐
묨
쓤
랈
퀑
듥
헋
뽂
퇼
흏
칯
뇥
먤
맇
욳
껙
룷
뗌
🙂
홱
궑
뛃
ˊ
ˋ
깕
뮝
핗
앧
뿩
핚
쩗
흦
끉
삱
옢
윿
🎂
╰
╯
웧
뙜
깣
넡

끆
먻
😰
😷
혱
힡
뱣
돰
뵴
빪
쭛
둚
픚
팒
뤍
붆
웗
틕
춟
낕
댭
늏
뭑
톂
걉
쇳
뫈
굘
🌌
🌆
🌃
🍚
💨
☕
💼
🏠
😺
💑
🍣
🌱
🎆
쬔
햗
쁰
👩
👧
걧
걳
슾
룅
뢘
헁
쭹
솢
떯
킺
ª
핽
줮
큑
죺
믯
탍
道
뻉
덝
돝
냤
쵬
뷉
멥
웑
푴
픋
쎋
뻙
틬
뙨
좄
뗰
퇑
엷
욦
뼜
쯛
눜
쥿
ᄊ
쒼
딻
쯥
맒
훃
꿬
솬
눳
흝
🧡
칑
츽
ã
힋
턿
뺡
뻭
뿽
🍻
똗
뛍
뽥
껗
튤
̥
숢
핝
뎝
쌱
갺
뇐
킘
찀
톳
꺤
넗
긒
뽭
붴
픁
싚
쌴
굯
헧
둧
홁
윋
칾
햙
횾
쏵
늧
짉
끡
쓧
룠
톄
펰
듞
탊
쏌
붤
읈
큡
윝
눰
쬑
칌
쁫
틑
찣
핕
흇
벝
츗
킸
퍵
룔
쾀
붝
쾃
먯
뢐
칔
쐤
뻛
굄
꼊
쥠
슀
휻
훸
맮
뵘
퀙
듟
갌
쑬
쥄
뷀
슽
럤
킅
뿥
쳪
○
心
訪
˚
풎
뿉
삠
튐
싨
さ
よ
な
ら
읉
렏
켖
🌊
🏽
🥂
얟
눦
첰
놁
줖
빆
೭
੧
੭
೨
곜
꿜
뤔
뜡
숤
뀹
즂
쎂
덛
잛
💫
⛄
춯
횜
벱
솚
퐅
즵
즴
꼠
뎤
쟡
놭
쟷
죈
※
쎁
뚧
💤
쯪
믁
륍
풸
뷕
얅
훪
돳
듓
슠
엝
셓
룀
쩓
쁏
둄
슫
컿
쏫
럑
냊
뵫
햰
댹
챼
맊
띳
뗬
풩
꽙
홇
헭
홃
겦
괃
붔
븠
끞
껓
왹
→
好
休
息
吧
做
菜
图
书
馆
쎴
쪝
봽
폅
몲
텸
욛
랆
룪
뚂
줳
틐
쓐
💔
븱
샃
덞
똻
몪
🐓
툊
냦
윛
햋
낿
뿃
뿁
찠
욈
쬿
쓕
퉛
둩
듹
랕
찓
슿
힢
먇
갲
셸
돀
늩
홡
홛
겊
돇
놎
숄
휗
훱
붭
욶
뜅
섦
븋
똡
뮙
궘
엲
쩖
꾴
씆
꾯
됗
뒵
듫
켛
깢
퓐
🐫
넾
엸
✍
씈
욾
쟼
쩤
̀
솦
젰
쯕
🌼
👱
쳘
웉
괁
🍼
뚸
슻
🍩
슲
꽠
꽦
꿿
꽔
꽧
꽊
챻
깧
욚
켸
섡
🐼
띧
🎈
잂
🖐
긧
🍙
횠
띸
쇾
윕
쿘
뷩
틩
찲
욫
륌
컺
얓
뤕
봜
욵
🐩
곥
쩄
ー
땼
힇
뮾
홰
왶
밫
죶
쫔
퐙
냍
쳒
🗿
🎥
컅
컃
춸
툲
짒
즎
줓
빷
셇
웇
텂
갳
겓
不
是
🎮
싦
먠
뻇
큱
헜
놥
줚
먛
音
횃
🐤
￼
쩠
쐰
됳
캍
걵
냃
챝
헽
뉩
쀔
떃
》
《
뢯
볩
쾡
굗
벴
걿
닟
웥
쀕
젙
‼
츃
릵
맖
롔
썯
갏
퓩
켭
긹
윜
씋
🔒
₩
뗑
굣
👌
뿢
븃
쥨
앾
♧
🤐
쌬
😓
룤
🙅
♂
븙
졑
돍
녾
짵
쒭
쏩
👻
칿
뛓
떘
츌
볽
삡
🌝
얆
읷
릍
틹
띙
럸
좈
홤
븢
몿
뱜
뮁
덖
턉
첧
껼
쿧
 
🍑
셪
벊
쨧
댶
왙
헾
뮜
뮵
귴
멯
읳
쎃
흒
랲
뷍
챟
딯
꺔
뽏
랋
짺
솹
묙
냒
쁙
！
괒
솼
듡
쨓
슏
쩰
붚
럊
됝
🐴
뵏
횔
숵
뭗
쫴
샪
섮
💌
놏
넏
둦
팹
쮄
툌
뉠
촨
쐄
쐥
쫜
뱽
뎹
뢒
뫚
뽸
쩑
귑
혴
읫
픟
핞
앺
첳
띪
텩
릻
닾
콺
먖
탙
놌
촞
밚
맿
덨
△
즑
밣
챶
삮
챊
킂
믖
땎
먽
꽄
껟
잜
곴
웄
뒺
듵
ε
얚
솯
붊
즣
벰
꾄
댏
챋
햫
솏
슂
쩢
껂
걑
눋
퓡
へ
쯐
섩
욎
췋
첱
턲
뷘
딶
댛
빘
쩧
륰
뀄
핯
촼
ㄶ
둤
믘
낃
냎
벶
볔
텬
핷
쉏
🎄
븥
뻈
낛
🌛
🌄
🐛
텽
젶
턌
벷
😖
봘
🙉
갵
🌻
꿏
욲
☁
셑
🏥
🍔
◎
덲
😧
밲
셖
☀
됍
쓉
딖
댚
럮
쩛
엃
췩
랅
밮
펃
앿
퀜
뙷
푤
옧
팦
킫
늰
퓍
🍯
븀
엜
턍
쏮
죚
뒇
뺫
쿳
뻫
튽
흓
홎
촏
굻
쭏
곷
덍
궆
꺋
□
짃
뒫
뤗
빂
츳
렅
훝
젋
떅
혇
탛
밳
낹
붅
{
렢
왅
뀟
짶
쓿
슧
롲
쳑
곙
죴
쾩
큄
꺟
🧐
켙
↑
쁟
뭀
몝
쳬
솽
쓍
덦
😦
듖
꼮
맫
곃
굇
얩
还
没
终
で
き
る
子
多
女
듑
🎎
틘
폘
쟸
륃
넁
펗
뱈
꽜
롘
찴
솃
윧
폨
●
٩
۶
럳
곦
꾺
쿻
